base/AccumulationRegisters/бит_ОборотыПоБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ОборотыПоБюджетам</Name>
			<Comment>(БИТ)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте операции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарий</Name>
					<Comment>Сумма в валюте сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСценарийЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КлючиСценарийЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыЗаписейОборотовПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов по бюджетам</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_1</Name>
					<Comment>Дополнительная аналитика № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_2</Name>
					<Comment>Дополнительная аналитика № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_3</Name>
					<Comment>Дополнительная аналитика № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_4</Name>
					<Comment>Дополнительная аналитика № 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_5</Name>
					<Comment>Дополнительная аналитика № 5</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_6</Name>
					<Comment>Дополнительная аналитика № 6</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_7</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_8</Name>
					<Comment>Дополнительная аналитика № 8</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_9</Name>
					<Comment>Дополнительная аналитика № 9</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_10</Name>
					<Comment>Дополнительная аналитика № 10</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_11</Name>
					<Comment>Дополнительная аналитика № 11</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_12</Name>
					<Comment>Дополнительная аналитика № 12</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

base/InformationRegisters/бит_НазначениеДополнительныхИзмерений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НазначениеДополнительныхИзмерений</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Синоним</Name>
					<Comment>Синоним</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика</Name>
					<Comment>Аналитика</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Comment>Обязательное</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяТипаПоУмолчанию</Name>
					<Comment>Тип значения по умолчанию для аналитики составного типа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяИзмерения</Name>
					<Comment>Имя измерения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

base/CommonModules/бит_PowerBIПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Версия10

// Возвращает специально подготовленную строку JSON с информацией о ЦФО.
//
// Параметры:
//  HTTPЗапрос	 - HTTPЗапрос	 - Содержит параметры запроса, в случае вызова из метода HTTP-сервиса бит_PowerBIAPI.
// 
// Возвращаемое значение:
//  Строка - Строка JSON,
//  Неопределено - Если отсутствует лицензия для Power BI.
//
Функция ЦФО(HTTPЗапрос = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Подразделения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ОборотыПоБюджетамОбороты.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ ВТЦФООставить
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|			,
	|			,
	|			,
	|			ЦФО В
	|				(ВЫБРАТЬ
	|					Подразделения.Ссылка
	|				ИЗ
	|					Справочник.Подразделения КАК Подразделения)) КАК бит_ОборотыПоБюджетамОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подразделения.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Подразделения.Родитель = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА Подразделения.Ссылка
	|		ИНАЧЕ Подразделения.Родитель
	|	КОНЕЦ КАК Родитель,
	|	Подразделения.Код КАК Код,
	|	Подразделения.Наименование КАК Наименование,
	|	Подразделения.Кодификатор КАК Кодификатор,
	|	Подразделения.ЯвляетсяЮрЛицом КАК ЯвляетсяЮрЛицом,
	|	Подразделения.ПризнакАктуальности КАК ПризнакАктуальности,
	|	Подразделения.ВидЦФО КАК ВидЦФО,
	|	Подразделения.Руководитель КАК Руководитель
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦФООставить КАК ВТЦФООставить
	|		ПО Подразделения.Ссылка = ВТЦФООставить.ЦФО
	|ГДЕ
	|	НЕ(Подразделения.ПометкаУдаления
	|				И ВТЦФООставить.ЦФО ЕСТЬ NULL)";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ПоляДопРеквизитов = УправлениеСвойствами.СвойстваОбъекта(Справочники.Подразделения.ПустаяСсылка());
	ДопРеквизиты = Неопределено;
	Ссылки = ПакетЗапросов[0].Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если Ссылки.Количество() > 0 Тогда
		ДопРеквизиты = УправлениеСвойствами.ЗначенияСвойств(Ссылки);
		ДопРеквизиты.Индексы.Добавить("ВладелецСвойств, Свойство");
	КонецЕсли;
	
	РезультатЗапроса = ПакетЗапросов[2];
	Если РезультатЗапроса.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Ссылка,
		|	"""" КАК Родитель,
		|	"""" КАК Код,
		|	"""" КАК Наименование,
		|	"""" КАК Кодификатор,
		|	"""" КАК ЯвляетсяЮрЛицом,
		|	"""" КАК ПризнакАктуальности,
		|	"""" КАК ВидЦФО,
		|	"""" КАК Руководитель";
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	ИменаКолонок = ИменаКолонокВнешнейСистемы();
	Поля = Новый СписокЗначений(); // Пометка "Истина", устанавливается у элемента ссылочного типа для выгрузки УИД.  
	Поля.Добавить("Ссылка",				ИменаКолонок.Ref_Key,					Истина);
	Поля.Добавить("Родитель",			ИменаКолонок.Parent_Key,				Истина);
	Поля.Добавить("Код",				ИменаКолонок.Код);
	Поля.Добавить("Наименование",		ИменаКолонок.ЦФО);
	Поля.Добавить("Кодификатор",		ИменаКолонок.КодификаторЦФО);
	Поля.Добавить("ЯвляетсяЮрЛицом",	ИменаКолонок.ЯвляетсяЮрЛицом);
	Поля.Добавить("ПризнакАктуальности",ИменаКолонок.ПризнакАктуальности);
	Поля.Добавить("ВидЦФО",				ИменаКолонок.ВидЦФО_Key,				Истина);
	Поля.Добавить("Руководитель",		ИменаКолонок.Руководитель_Key,			Истина);
	
	ПараметрыПолучения = бит_PowerBIСлужебный.НовыеПараметрыПолучения();
	ПараметрыПолучения.Поля				= Поля;
	ПараметрыПолучения.РезультатЗапроса	= РезультатЗапроса;
	ПараметрыПолучения.HTTPЗапрос	    = HTTPЗапрос; 
	ПараметрыПолучения.ПоляДопРеквизитов= ПоляДопРеквизитов; 
	ПараметрыПолучения.ДопРеквизиты		= ДопРеквизиты; 
	Возврат бит_PowerBIСлужебный.ПолучитьСтрокуJSON(ПараметрыПолучения); 
	
КонецФункции

// Возвращает специально подготовленную строку JSON с информацией о статьях оборотов.
//
// Параметры:
//  HTTPЗапрос	 - HTTPЗапрос	 - Содержит параметры запроса, в случае вызова из метода HTTP-сервиса бит_PowerBIAPI.
// 
// Возвращаемое значение:
//  Строка - Строка JSON,
//  Неопределено - Если отсутствует лицензия для Power BI.
//
Функция СтатьиОборотов(HTTPЗапрос = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтатьиОборотов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов КАК СтатьяОборотов
	|ПОМЕСТИТЬ ВТСтатьиОборотовОставить
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|			,
	|			,
	|			,
	|			СтатьяОборотов В
	|				(ВЫБРАТЬ
	|					бит_СтатьиОборотов.Ссылка
	|				ИЗ
	|					Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов)) КАК бит_ОборотыПоБюджетамОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяОборотов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СтатьиОборотов.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА бит_СтатьиОборотов.Родитель = ЗНАЧЕНИЕ(Справочник.бит_СтатьиОборотов.ПустаяСсылка)
	|			ТОГДА бит_СтатьиОборотов.Ссылка
	|		ИНАЧЕ бит_СтатьиОборотов.Родитель
	|	КОНЕЦ КАК Родитель,
	|	бит_СтатьиОборотов.Код КАК Код,
	|	бит_СтатьиОборотов.Наименование КАК Наименование,
	|	бит_СтатьиОборотов.Кодификатор КАК Кодификатор,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_СтатьиОборотов.РасходДоход) КАК РасходДоход,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_СтатьиОборотов.ВидСтатьи) КАК ВидСтатьи,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_СтатьиОборотов.ТипСтатьи) КАК ТипСтатьи,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_СтатьиОборотов.СтавкаНДС) КАК СтавкаНДС,
	|	бит_СтатьиОборотов.Учет_Количество КАК УчетКоличество,
	|	бит_СтатьиОборотов.Учет_Сумма КАК УчетСумма,
	|	бит_СтатьиОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатьиОборотовОставить КАК ВТСтатьиОборотовОставить
	|		ПО бит_СтатьиОборотов.Ссылка = ВТСтатьиОборотовОставить.СтатьяОборотов
	|ГДЕ
	|	НЕ(бит_СтатьиОборотов.ПометкаУдаления
	|				И ВТСтатьиОборотовОставить.СтатьяОборотов ЕСТЬ NULL)";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ПоляДопРеквизитов = УправлениеСвойствами.СвойстваОбъекта(Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	ДопРеквизиты = Неопределено;
	Ссылки = ПакетЗапросов[0].Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если Ссылки.Количество() > 0 Тогда
		ДопРеквизиты = УправлениеСвойствами.ЗначенияСвойств(Ссылки);
		ДопРеквизиты.Индексы.Добавить("ВладелецСвойств, Свойство");
	КонецЕсли;
	
	РезультатЗапроса = ПакетЗапросов[2];
	Если РезультатЗапроса.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Ссылка,
		|	"""" КАК Родитель,
		|	"""" КАК Код,
		|	"""" КАК Наименование,
		|	"""" КАК Кодификатор,
		|	"""" КАК РасходДоход,
		|	"""" КАК ВидСтатьи,
		|	"""" КАК ТипСтатьи,
		|	"""" КАК СтавкаНДС,
		|	"""" КАК УчетКоличество,
		|	"""" КАК УчетСумма,
		|	"""" КАК ЭтоКоэффициент";
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	ИменаКолонок = ИменаКолонокВнешнейСистемы();
	Поля = Новый СписокЗначений(); // Пометка "Истина", устанавливается у элемента ссылочного типа для выгрузки УИД.  
	Поля.Добавить("Ссылка",			ИменаКолонок.Ref_Key, 			Истина);
	Поля.Добавить("Родитель",		ИменаКолонок.Parent_Key, 		Истина);
	Поля.Добавить("Код",			ИменаКолонок.Код);
	Поля.Добавить("Наименование",	ИменаКолонок.СтатьяОборотов);
	Поля.Добавить("Кодификатор",	ИменаКолонок.КодификаторСтатьи);
	Поля.Добавить("РасходДоход",	ИменаКолонок.РасходДоход);
	Поля.Добавить("ВидСтатьи",		ИменаКолонок.ВидСтатьи);
	Поля.Добавить("ТипСтатьи",		ИменаКолонок.ТипСтатьи);
	Поля.Добавить("СтавкаНДС",		ИменаКолонок.СтавкаНДС);
	Поля.Добавить("УчетКоличество",	ИменаКолонок.УчетКоличество);
	Поля.Добавить("УчетСумма",		ИменаКолонок.УчетСумма);
	Поля.Добавить("ЭтоКоэффициент",	ИменаКолонок.ЭтоКоэффициент);
	
	ПараметрыПолучения = бит_PowerBIСлужебный.НовыеПараметрыПолучения();
	ПараметрыПолучения.Поля				= Поля;
	ПараметрыПолучения.РезультатЗапроса	= РезультатЗапроса;
	ПараметрыПолучения.HTTPЗапрос	    = HTTPЗапрос; 
	ПараметрыПолучения.ПоляДопРеквизитов= ПоляДопРеквизитов; 
	ПараметрыПолучения.ДопРеквизиты		= ДопРеквизиты; 
	Возврат бит_PowerBIСлужебный.ПолучитьСтрокуJSON(ПараметрыПолучения); 
	
КонецФункции

// Возвращает специально подготовленную строку JSON с информацией о валютах.
//
// Параметры:
//  HTTPЗапрос	 - HTTPЗапрос	 - Содержит параметры запроса, в случае вызова из метода HTTP-сервиса бит_PowerBIAPI.
// 
// Возвращаемое значение:
//  Строка - Строка JSON,
//  Неопределено - Если отсутствует лицензия для Power BI.
//
Функция Валюты(HTTPЗапрос = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ОборотыПоБюджетамОбороты.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТВалютыОставить
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|			,
	|			,
	|			,
	|			Валюта В
	|				(ВЫБРАТЬ
	|					Валюты.Ссылка
	|				ИЗ
	|					Справочник.Валюты КАК Валюты)) КАК бит_ОборотыПоБюджетамОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка,
	|	Валюты.Код КАК Код,
	|	Валюты.Наименование КАК Наименование,
	|	Валюты.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВалютыОставить КАК ВТВалютыОставить
	|		ПО Валюты.Ссылка = ВТВалютыОставить.Валюта
	|ГДЕ
	|	НЕ(Валюты.ПометкаУдаления
	|				И ВТВалютыОставить.Валюта ЕСТЬ NULL)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Ссылка,
		|	"""" КАК Код,
		|	"""" КАК Наименование,
		|	"""" КАК НаименованиеПолное";
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	ИменаКолонок = ИменаКолонокВнешнейСистемы();
	Поля = Новый СписокЗначений(); // Пометка "Истина", устанавливается у элемента ссылочного типа для выгрузки УИД.  
	Поля.Добавить("Ссылка",				ИменаКолонок.Ref_Key, Истина);
	Поля.Добавить("Код",				ИменаКолонок.Код);
	Поля.Добавить("Наименование",		ИменаКолонок.Валюта);
	Поля.Добавить("НаименованиеПолное",	ИменаКолонок.ПолноеНаименование);
	
	ПараметрыПолучения = бит_PowerBIСлужебный.НовыеПараметрыПолучения();
	ПараметрыПолучения.Поля				= Поля;
	ПараметрыПолучения.РезультатЗапроса	= РезультатЗапроса;
	ПараметрыПолучения.HTTPЗапрос	    = HTTPЗапрос; 
	Возврат бит_PowerBIСлужебный.ПолучитьСтрокуJSON(ПараметрыПолучения); 
	
КонецФункции

// Возвращает специально подготовленную строку JSON с информацией о валютах учета (регламентированного/управленческого).
//
// Параметры:
//  HTTPЗапро	 - HTTPЗапрос	 - Содержит параметры запроса, в случае вызова из метода HTTP-сервиса бит_PowerBIAPI.
// 
// Возвращаемое значение:
//  Строка - Строка JSON.
//
Функция ВалютыУчета(HTTPЗапро = Неопределено) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("Учет");
	ЗаписьJSON.ЗаписатьЗначение("Регл.");
	ЗаписьJSON.ЗаписатьИмяСвойства("Валюта");
	ЗаписьJSON.ЗаписатьЗначение(Строка(ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета()));
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("Учет");
	ЗаписьJSON.ЗаписатьЗначение("Упр.");
	ЗаписьJSON.ЗаписатьИмяСвойства("Валюта");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Константы.бит_ВалютаУправленческогоУчета.Получить()));
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	СтрJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрJSON;
	
КонецФункции

// Возвращает специально подготовленную строку JSON с информацией об оборотах по бюджету.
//
// Параметры:
//  HTTPЗапрос	 - HTTPЗапрос	 - Содержит параметры запроса, в случае вызова из метода HTTP-сервиса бит_PowerBIAPI.
// 
// Возвращаемое значение:
//  Строка - Строка JSON,
//  Неопределено - Если отсутствует лицензия для Power BI.
//
Функция ОборотыПоБюджетам(HTTPЗапрос = Неопределено) Экспорт
	
	СтруктураНастроек = бит_PowerBIСлужебный.ПолучитьНастройикPowerBI();
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(СтруктураНастроек.ДатаНачала) Тогда
		Запрос.УстановитьПараметр("НачалоПериода", СтруктураНастроек.ДатаНачала);
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", Дата(2000, 01, 01));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураНастроек.ДатаОкончания) Тогда
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(СтруктураНастроек.ДатаОкончания));
	Иначе
		Запрос.УстановитьПараметр("КонецПериода", Дата(2036, 12, 31));
	КонецЕсли;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ОборотыПоБюджетамОбороты.Период КАК Период,
	|	бит_ОборотыПоБюджетамОбороты.Сценарий КАК Сценарий,
	|	бит_ОборотыПоБюджетамОбороты.ЦФО КАК ЦФО,
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов КАК СтатьяОборотов,
	|	бит_ОборотыПоБюджетамОбороты.Валюта КАК Валюта,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_1 КАК Аналитика_1_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_2 КАК Аналитика_2_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_3 КАК Аналитика_3_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_4 КАК Аналитика_4_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_5 КАК Аналитика_5_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_6 КАК Аналитика_6_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_7 КАК Аналитика_7_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_8 КАК Аналитика_8_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_9 КАК Аналитика_9_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_10 КАК Аналитика_10_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_11 КАК Аналитика_11_Key,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_12 КАК Аналитика_12_Key,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_1) КАК Аналитика_1,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_2) КАК Аналитика_2,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_3) КАК Аналитика_3,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_4) КАК Аналитика_4,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_5) КАК Аналитика_5,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_6) КАК Аналитика_6,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_7) КАК Аналитика_7,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_8) КАК Аналитика_8,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_9) КАК Аналитика_9,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_10) КАК Аналитика_10,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_11) КАК Аналитика_11,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(бит_ОборотыПоБюджетамОбороты.Аналитика_12) КАК Аналитика_12,
	|	бит_ОборотыПоБюджетамОбороты.КоличествоОборот КАК КоличествоОборот,
	|	бит_ОборотыПоБюджетамОбороты.СуммаОборот КАК СуммаОборот,
	|	бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот КАК СуммаРеглОборот,
	|	бит_ОборотыПоБюджетамОбороты.СуммаУпрОборот КАК СуммаУпрОборот,
	|	бит_ОборотыПоБюджетамОбороты.СуммаСценарийОборот КАК СуммаСценарийОборот
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(&НачалоПериода, &КонецПериода, День, ) КАК бит_ОборотыПоБюджетамОбороты";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Период,
		|	"""" КАК Сценарий,
		|	"""" КАК ЦФО,
		|	"""" КАК СтатьяОборотов,
		|	"""" КАК Валюта,
		|	"""" КАК Аналитика_1_Key,
		|	"""" КАК Аналитика_2_Key,
		|	"""" КАК Аналитика_3_Key,
		|	"""" КАК Аналитика_4_Key,
		|	"""" КАК Аналитика_5_Key,
		|	"""" КАК Аналитика_6_Key,
		|	"""" КАК Аналитика_7_Key,
		|	"""" КАК Аналитика_8_Key,
		|	"""" КАК Аналитика_9_Key,
		|	"""" КАК Аналитика_10_Key,
		|	"""" КАК Аналитика_11_Key,
		|	"""" КАК Аналитика_12_Key,
		|	"""" КАК Аналитика_1,
		|	"""" КАК Аналитика_2,
		|	"""" КАК Аналитика_3,
		|	"""" КАК Аналитика_4,
		|	"""" КАК Аналитика_5,
		|	"""" КАК Аналитика_6,
		|	"""" КАК Аналитика_7,
		|	"""" КАК Аналитика_8,
		|	"""" КАК Аналитика_9,
		|	"""" КАК Аналитика_10,
		|	"""" КАК Аналитика_11,
		|	"""" КАК Аналитика_12,
		|	"""" КАК КоличествоОборот,
		|	"""" КАК СуммаОборот,
		|	"""" КАК СуммаРеглОборот,
		|	"""" КАК СуммаУпрОборот,
		|	"""" КАК СуммаСценарийОборот";
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	ИменаКолонок = ИменаКолонокВнешнейСистемы();
	Поля = Новый СписокЗначений(); // Пометка "Истина", устанавливается у элемента ссылочного типа для выгрузки УИД.  
	Поля.Добавить("Период",					ИменаКолонок.Период);
	Поля.Добавить("Сценарий",				ИменаКолонок.Сценарий_Key,		Истина);
	Поля.Добавить("ЦФО",					ИменаКолонок.ЦФО_Key,			Истина);
	Поля.Добавить("СтатьяОборотов",			ИменаКолонок.СтатьяОборотов_Key,Истина);
	Поля.Добавить("Валюта",					ИменаКолонок.Валюта_Key,		Истина);
	Поля.Добавить("Аналитика_1_Key",		ИменаКолонок.Аналитика_1_Key,	Истина);
	Поля.Добавить("Аналитика_2_Key",		ИменаКолонок.Аналитика_2_Key,	Истина);
	Поля.Добавить("Аналитика_3_Key",		ИменаКолонок.Аналитика_3_Key,	Истина);
	Поля.Добавить("Аналитика_4_Key",		ИменаКолонок.Аналитика_4_Key,	Истина);
	Поля.Добавить("Аналитика_5_Key",		ИменаКолонок.Аналитика_5_Key,	Истина);
	Поля.Добавить("Аналитика_6_Key",		ИменаКолонок.Аналитика_6_Key,	Истина);
	Поля.Добавить("Аналитика_7_Key",		ИменаКолонок.Аналитика_7_Key,	Истина);
	Поля.Добавить("Аналитика_8_Key",		ИменаКолонок.Аналитика_8_Key,	Истина);
	Поля.Добавить("Аналитика_9_Key",		ИменаКолонок.Аналитика_9_Key,	Истина);
	Поля.Добавить("Аналитика_10_Key",		ИменаКолонок.Аналитика_10_Key,	Истина);
	Поля.Добавить("Аналитика_11_Key",		ИменаКолонок.Аналитика_11_Key,	Истина);
	Поля.Добавить("Аналитика_12_Key",		ИменаКолонок.Аналитика_12_Key,	Истина);
	Поля.Добавить("Аналитика_1",			ИменаКолонок.Аналитика_1,		Истина);
	Поля.Добавить("Аналитика_2",			ИменаКолонок.Аналитика_2,		Истина);
	Поля.Добавить("Аналитика_3",			ИменаКолонок.Аналитика_3,		Истина);
	Поля.Добавить("Аналитика_4",			ИменаКолонок.Аналитика_4,		Истина);
	Поля.Добавить("Аналитика_5",			ИменаКолонок.Аналитика_5,		Истина);
	Поля.Добавить("Аналитика_6",			ИменаКолонок.Аналитика_6,		Истина);
	Поля.Добавить("Аналитика_7",			ИменаКолонок.Аналитика_7,		Истина);
	Поля.Добавить("Аналитика_8",			ИменаКолонок.Аналитика_8,		Истина);
	Поля.Добавить("Аналитика_9",			ИменаКолонок.Аналитика_9,		Истина);
	Поля.Добавить("Аналитика_10",			ИменаКолонок.Аналитика_10,		Истина);
	Поля.Добавить("Аналитика_11",			ИменаКолонок.Аналитика_11,		Истина);
	Поля.Добавить("Аналитика_12",			ИменаКолонок.Аналитика_12,		Истина);
	Поля.Добавить("КоличествоОборот",		ИменаКолонок.Количество);
	Поля.Добавить("СуммаОборот",			ИменаКолонок.Сумма);
	Поля.Добавить("СуммаРеглОборот",		ИменаКолонок.СуммаРегл);
	Поля.Добавить("СуммаУпрОборот",			ИменаКолонок.СуммаУпр);
	Поля.Добавить("СуммаСценарийОборот",	ИменаКолонок.СуммаСценария);
	
	ПараметрыПолучения = бит_PowerBIСлужебный.НовыеПараметрыПолучения();
	ПараметрыПолучения.Поля				= Поля;
	ПараметрыПолучения.РезультатЗапроса	= РезультатЗапроса;
	ПараметрыПолучения.HTTPЗапрос	    = HTTPЗапрос; 
	Возврат бит_PowerBIСлужебный.ПолучитьСтрокуJSON(ПараметрыПолучения); 
	
КонецФункции 

// Возвращает специально подготовленную строку JSON с информацией об аналитиках.
//
// Параметры:
//  HTTPЗапрос	 - HTTPЗапрос	 - Содержит параметры запроса, в случае вызова из метода HTTP-сервиса бит_PowerBIAPI.
// 
// Возвращаемое значение:
//  Строка - Строка JSON,
//  Неопределено - Если отсутствует лицензия для Power BI.
//
Функция СинонимыАналитик(HTTPЗапрос = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсточникНастроек.ИмяИзмерения КАК ИмяИзмерения,
	|	ИсточникНастроек.Синоним КАК Синоним
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК ИсточникНастроек";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ДопИзмерения = Новый Структура;
	Пока Выборка.Следующий() Цикл
		ДопИзмерения.Вставить(Выборка.ИмяИзмерения, Выборка.Синоним);
	КонецЦикла;
	
	ИменаКолонок = ИменаКолонокВнешнейСистемы();
	Колонки = Новый Структура();
	Колонки.Вставить("Аналитика_1",			ИменаКолонок.Аналитика_1);
	Колонки.Вставить("Аналитика_2",			ИменаКолонок.Аналитика_2);
	Колонки.Вставить("Аналитика_3",			ИменаКолонок.Аналитика_3);
	Колонки.Вставить("Аналитика_4",			ИменаКолонок.Аналитика_4);
	Колонки.Вставить("Аналитика_5",			ИменаКолонок.Аналитика_5);
	Колонки.Вставить("Аналитика_6",			ИменаКолонок.Аналитика_6);
	Колонки.Вставить("Аналитика_7",			ИменаКолонок.Аналитика_7);
	Колонки.Вставить("Аналитика_8",			ИменаКолонок.Аналитика_8);
	Колонки.Вставить("Аналитика_9",			ИменаКолонок.Аналитика_9);
	Колонки.Вставить("Аналитика_10",		ИменаКолонок.Аналитика_10);
	Колонки.Вставить("Аналитика_11",		ИменаКолонок.Аналитика_11);
	Колонки.Вставить("Аналитика_12",		ИменаКолонок.Аналитика_12);

	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого СвойствоКолонки Из Колонки Цикл
		ИмяКолонки = Неопределено;
		ДопИзмерения.Свойство(СвойствоКолонки.Ключ, ИмяКолонки);
		Если ИмяКолонки = Неопределено Тогда
			ИмяКолонки = СвойствоКолонки.Значение;
		КонецЕсли;
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("Имя_аналиики");
		ЗаписьJSON.ЗаписатьЗначение(СвойствоКолонки.Ключ);
		ЗаписьJSON.ЗаписатьИмяСвойства("Синоним");
		ЗаписьJSON.ЗаписатьЗначение(ИмяКолонки);
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		// Ключи доп. аналитик.
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("Имя_аналиики");
		ЗаписьJSON.ЗаписатьЗначение(СвойствоКолонки.Ключ + "_Key");
		ЗаписьJSON.ЗаписатьИмяСвойства("Синоним");
		ЗаписьJSON.ЗаписатьЗначение(ИмяКолонки + "_Key");
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла; 
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	СтрJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрJSON;
		
КонецФункции

// Возвращает специально подготовленную строку JSON с информацией о видах ЦФО.
//
// Параметры:
//  HTTPЗапрос	 - HTTPЗапрос	 - Содержит параметры запроса, в случае вызова из метода HTTP-сервиса бит_PowerBIAPI.
// 
// Возвращаемое значение:
//  Строка - Строка JSON,
//  Неопределено - Если отсутствует лицензия для Power BI.
//
Функция ВидыЦФО(HTTPЗапрос = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ОборотыПоБюджетамОбороты.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ ВТЦФООставить
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|			,
	|			,
	|			,
	|			ЦФО В
	|				(ВЫБРАТЬ
	|					Подразделения.Ссылка
	|				ИЗ
	|					Справочник.Подразделения КАК Подразделения)) КАК бит_ОборотыПоБюджетамОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.ВидЦФО КАК ВидЦФО
	|ПОМЕСТИТЬ ВТВидЦФООставить
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦФООставить КАК ВТЦФООставить
	|		ПО Подразделения.Ссылка = ВТЦФООставить.ЦФО
	|ГДЕ
	|	НЕ(Подразделения.ПометкаУдаления
	|				И ВТЦФООставить.ЦФО ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыЦФО.Ссылка КАК Ссылка,
	|	ВидыЦФО.Код КАК Код,
	|	ВидыЦФО.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыЦФО КАК ВидыЦФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидЦФООставить КАК ВТВидЦФООставить
	|		ПО ВидыЦФО.Ссылка = ВТВидЦФООставить.ВидЦФО
	|ГДЕ
	|	НЕ(ВидыЦФО.ПометкаУдаления
	|				И ВТВидЦФООставить.ВидЦФО ЕСТЬ NULL)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Ссылка,
		|	"""" КАК Код,
		|	"""" КАК Наименование";
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	ИменаКолонок = ИменаКолонокВнешнейСистемы();
	Поля = Новый СписокЗначений(); // Пометка "Истина", устанавливается у элемента ссылочного типа для выгрузки УИД.  
	Поля.Добавить("Ссылка",			ИменаКолонок.Ref_Key, Истина);
	Поля.Добавить("Код",			ИменаКолонок.Код);
	Поля.Добавить("Наименование",	ИменаКолонок.ВидЦФО);
	
	ПараметрыПолучения = бит_PowerBIСлужебный.НовыеПараметрыПолучения();
	ПараметрыПолучения.Поля				= Поля;
	ПараметрыПолучения.РезультатЗапроса	= РезультатЗапроса;
	ПараметрыПолучения.HTTPЗапрос	    = HTTPЗапрос; 
	Возврат бит_PowerBIСлужебный.ПолучитьСтрокуJSON(ПараметрыПолучения); 
	
КонецФункции

// Возвращает специально подготовленную строку JSON с информацией о сценариях бюджетирования.
//
// Параметры:
//  HTTPЗапрос	 - HTTPЗапрос	 - Содержит параметры запроса, в случае вызова из метода HTTP-сервиса бит_PowerBIAPI.
// 
// Возвращаемое значение:
//  Строка - Строка JSON,
//  Неопределено - Если отсутствует лицензия для Power BI.
//
Функция СценарииБюджетирования(HTTPЗапрос = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ОборотыПоБюджетамОбороты.Сценарий КАК Сценарий
	|ПОМЕСТИТЬ ВТСценарийОставить
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|			,
	|			,
	|			,
	|			Сценарий В
	|				(ВЫБРАТЬ
	|					СценарииПланирования.Ссылка
	|				ИЗ
	|					Справочник.СценарииПланирования КАК СценарииПланирования)) КАК бит_ОборотыПоБюджетамОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сценарий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СценарииПланирования.Ссылка КАК Ссылка,
	|	СценарииПланирования.Код КАК Код,
	|	СценарииПланирования.Наименование КАК Наименование
	|ИЗ
	|	Справочник.СценарииПланирования КАК СценарииПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСценарийОставить КАК ВТСценарийОставить
	|		ПО СценарииПланирования.Ссылка = ВТСценарийОставить.Сценарий
	|ГДЕ
	|	НЕ(СценарииПланирования.ПометкаУдаления
	|				И ВТСценарийОставить.Сценарий ЕСТЬ NULL)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Ссылка,
		|	"""" КАК Код,
		|	"""" КАК Наименование";
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	ИменаКолонок = ИменаКолонокВнешнейСистемы();
	Поля = Новый СписокЗначений(); // Пометка "Истина", устанавливается у элемента ссылочного типа для выгрузки УИД.  
	Поля.Добавить("Ссылка",			ИменаКолонок.Ref_Key, Истина);
	Поля.Добавить("Код",			ИменаКолонок.Код);
	Поля.Добавить("Наименование",	ИменаКолонок.СценарийБюджетирования);
	
	ПараметрыПолучения = бит_PowerBIСлужебный.НовыеПараметрыПолучения();
	ПараметрыПолучения.Поля				= Поля;
	ПараметрыПолучения.РезультатЗапроса	= РезультатЗапроса;
	ПараметрыПолучения.HTTPЗапрос	    = HTTPЗапрос; 
	Возврат бит_PowerBIСлужебный.ПолучитьСтрокуJSON(ПараметрыПолучения); 
	
КонецФункции

// Возвращает специально подготовленную строку JSON с информацией о движения по кассе, расчетным и валютным счетам.
//
// Параметры:
//  HTTPЗапрос	 - HTTPЗапрос	 - Содержит параметры запроса, в случае вызова из метода HTTP-сервиса бит_PowerBIAPI.
// 
// Возвращаемое значение:
//  Строка - Строка JSON,
//  Неопределено - Если отсутствует лицензия для Power BI.
//
Функция ОстаткиДС(HTTPЗапрос = Неопределено) Экспорт
	
	СчетаРасчетовСПодотчетнымиЛицами = Новый Массив();
	СчетаРасчетовСПодотчетнымиЛицами.Добавить(ПланыСчетов.Хозрасчетный.Касса);
	СчетаРасчетовСПодотчетнымиЛицами.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);
	СчетаРасчетовСПодотчетнымиЛицами.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);
	 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СчетаРасчетовСПодотчетнымиЛицами", СчетаРасчетовСПодотчетнымиЛицами);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ХозрасчетныйОстатки.Счет) КАК Счет,
	|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ХозрасчетныйОстатки.Субконто1) КАК БанковскийСчет,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЕСТЬNULL(ХозрасчетныйОстатки.Валюта, &ВалютаРегламентированногоУчета)) КАК Валюта,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОстатков, Счет В (&СчетаРасчетовСПодотчетнымиЛицами), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.БанковскиеСчета), ) КАК ХозрасчетныйОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Счет,
		|	"""" КАК Субконто1,
		|	"""" КАК БанковскийСчет,
		|	"""" КАК Валюта,
		|	"""" КАК СуммаОстаток,
		|	"""" КАК ВалютнаяСуммаОстаток";
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	ИменаКолонок = ИменаКолонокВнешнейСистемы();
	Поля = Новый СписокЗначений(); // Пометка "Истина", устанавливается у элемента ссылочного типа для выгрузки УИД.  
	Поля.Добавить("Счет",					ИменаКолонок.Счет);
	Поля.Добавить("Субконто1",				ИменаКолонок.БанковскийСчет_Key, Истина);
	Поля.Добавить("БанковскийСчет",			ИменаКолонок.БанковскийСчет);
	Поля.Добавить("Валюта",					ИменаКолонок.Валюта);
	Поля.Добавить("СуммаОстаток",			ИменаКолонок.СуммаОстаток);
	Поля.Добавить("ВалютнаяСуммаОстаток",	ИменаКолонок.ВалютнаяСуммаОстаток);
	
	ПараметрыПолучения = бит_PowerBIСлужебный.НовыеПараметрыПолучения();
	ПараметрыПолучения.Поля				= Поля;
	ПараметрыПолучения.РезультатЗапроса	= РезультатЗапроса;
	ПараметрыПолучения.HTTPЗапрос	    = HTTPЗапрос; 
	Возврат бит_PowerBIСлужебный.ПолучитьСтрокуJSON(ПараметрыПолучения); 
	
КонецФункции

#КонецОбласти

// Возвращает структуру с именами колонок для Power BI.
// Используется для локализации ошибки АПК №1297.
Функция ИменаКолонокВнешнейСистемы()
	
	// АПК:1297-выкл Не локализуется, идентификаторы внешней системы.
	ИменаКолонок = Новый Структура;
	
	// ПолучитьЗадолженностьКТ. ПолучитьЗадолженностьДТ.
	ИменаКолонок.Вставить("Контрагент_Key",				"Контрагент_Key");
	ИменаКолонок.Вставить("Контрагент",					"Контрагент");
	ИменаКолонок.Вставить("Организация_Key",			"Организация_Key");
	ИменаКолонок.Вставить("Организация",				"Организация");
	ИменаКолонок.Вставить("ОстатокДолга",				"Остаток долга");
	ИменаКолонок.Вставить("ПросроченнаяЗадолженность",	"Просроченная задолженность");
	ИменаКолонок.Вставить("ОстатокПериода1",			"До 7 дней");
	ИменаКолонок.Вставить("ОстатокПериода2",			"От 8 до 15 дней");
	ИменаКолонок.Вставить("ОстатокПериода3",			"От 16 до 30 дней");
	ИменаКолонок.Вставить("ОстатокПериода4",			"От 31 до 60 дней");
	ИменаКолонок.Вставить("ОстатокПериода5",			"От 61 до 90 дней");
	ИменаКолонок.Вставить("ОстатокПериода6",			"Свыше 90 дней");
	
	// ПолучитьОстаткиДС.
	ИменаКолонок.Вставить("Счет",						"Счет");
	ИменаКолонок.Вставить("БанковскийСчет_Key",			"БанковскийСчет_Key");
	ИменаКолонок.Вставить("БанковскийСчет",				"Банковский счет");
	ИменаКолонок.Вставить("Валюта",						"Валюта");
	ИменаКолонок.Вставить("Валюта_Key",					"Валюта_Key");
	ИменаКолонок.Вставить("СуммаОстаток",				"Остаток ДС");
	ИменаКолонок.Вставить("ВалютнаяСуммаОстаток",		"Остаток ДС вал.");
	
	// Визирование.
	ИменаКолонок.Вставить("Объект",						"Объект");
	ИменаКолонок.Вставить("Виза",						"Виза");
	ИменаКолонок.Вставить("Пользователь",				"Пользователь");
	ИменаКолонок.Вставить("ФизическоеЛицо",				"Физическое лицо");
	ИменаКолонок.Вставить("Должность",					"Должность");
	ИменаКолонок.Вставить("ДатаУстановки",				"Дата установки");
	ИменаКолонок.Вставить("ДатаКрайняя",				"Дата крайняя");
	ИменаКолонок.Вставить("ВремяНаУстановку",			"Время на установку");
	ИменаКолонок.Вставить("Статус",						"Статус");
	ИменаКолонок.Вставить("Решение",					"Решение");
	ИменаКолонок.Вставить("Алгоритм",					"Алгоритм");
	ИменаКолонок.Вставить("АктивнаяВиза",				"АктивнаяВиза");
	
	// Общие.
	ИменаКолонок.Вставить("Ref_Key",					"Ref_Key");
	ИменаКолонок.Вставить("Parent_Key",					"Parent_Key");
	ИменаКолонок.Вставить("Код",						"Код");
	ИменаКолонок.Вставить("ЦФО",						"ЦФО");
	ИменаКолонок.Вставить("ЦФО_Key",					"ЦФО_Key");
	ИменаКолонок.Вставить("КодификаторЦФО",				"Кодификатор ЦФО");
	ИменаКолонок.Вставить("ЯвляетсяЮрЛицом",			"Является юридическим лицом");
	ИменаКолонок.Вставить("ПризнакАктуальности",		"Признак актуальности");
	ИменаКолонок.Вставить("ВидЦФО_Key",					"ВидЦФО_Key");
	ИменаКолонок.Вставить("Руководитель_Key",			"Руководитель_Key");
	ИменаКолонок.Вставить("СценарийБюджетирования",		"Сценарий бюджетирования");
	ИменаКолонок.Вставить("СтатьяОборотов",				"Статья оборотов");
	ИменаКолонок.Вставить("СтатьяОборотов_Key",			"СтатьяОборотов_Key");
	ИменаКолонок.Вставить("КодификаторСтатьи",			"Кодификатор статьи");
	ИменаКолонок.Вставить("РасходДоход",				"Направление (Поступление / Расходование)");
	ИменаКолонок.Вставить("ВидДенежныхСредств",			"Вид денежных средств");
	ИменаКолонок.Вставить("ВидСтатьи",					"Вид статьи");
	ИменаКолонок.Вставить("ТипСтатьи",					"Тип статьи");
	ИменаКолонок.Вставить("СтавкаНДС",					"% НДС");
	ИменаКолонок.Вставить("УчетКоличество",				"Учет по количеству");
	ИменаКолонок.Вставить("УчетСумма",					"Учет по сумме");
	ИменаКолонок.Вставить("ЭтоКоэффициент",				"Это коэффициент");
	ИменаКолонок.Вставить("Единица",					"Единица");
	ИменаКолонок.Вставить("Проект",						"Проект");
	ИменаКолонок.Вставить("Проект_Key",					"Проект_Key");
	ИменаКолонок.Вставить("КодификаторПроекта",			"Кодификатор проекта");
	ИменаКолонок.Вставить("Страна",						"Страна");
	ИменаКолонок.Вставить("СтранаРегистрации",			"Страна регистрации");
	ИменаКолонок.Вставить("Группа",						"Группа");
	ИменаКолонок.Вставить("ГруппаКод",					"Код группы");
	ИменаКолонок.Вставить("НаименованиеПолное",			"Наименование полное");
	ИменаКолонок.Вставить("ОсновнаяСтатьяДДС",			"Основная статья ДДС");
	ИменаКолонок.Вставить("Дата",						"Дата");
	
	ИменаКолонок.Вставить("Период",						"Период");
	ИменаКолонок.Вставить("Сценарий",					"Сценарий");
	ИменаКолонок.Вставить("СценарийКонтролируемый",		"Сценарий контролируемый");
	ИменаКолонок.Вставить("Сценарий_Key",				"Сценарий_Key");
	ИменаКолонок.Вставить("ДоговорКонтрагента_Key",		"ДоговорКонтрагента_Key");
	ИменаКолонок.Вставить("ДоговорКонтрагента",			"Договор контрагента");
	ИменаКолонок.Вставить("НоменклатурнаяГруппа_Key",	"НоменклатурнаяГруппа_Key");
	ИменаКолонок.Вставить("НоменклатурнаяГруппа",		"Номенклатурная группа");
	ИменаКолонок.Вставить("Количество",					"Количество");
	ИменаКолонок.Вставить("Сумма",						"Сумма");
	ИменаКолонок.Вставить("СуммаРегл",					"Сумма регл.");
	ИменаКолонок.Вставить("СуммаУпр",					"Сумма упр.");
	ИменаКолонок.Вставить("СуммаСценария",				"Сумма сценария");
	ИменаКолонок.Вставить("СуммаКонтроль",				"Сумма контроль");
	ИменаКолонок.Вставить("СуммаИсполнение",			"Сумма исполнение");
	ИменаКолонок.Вставить("СуммаВзаиморасчеты",			"Сумма взаиморасчеты");
	ИменаКолонок.Вставить("КоличествоКонтроль",			"Количество контроль");
	ИменаКолонок.Вставить("КоличествоИсполнение",		"Количество исполнение");
	ИменаКолонок.Вставить("ПолноеНаименование",			"Полное наименование");
	ИменаКолонок.Вставить("ВидЦФО",						"Вид ЦФО");
	
	ИменаКолонок.Вставить("КодСценарий",				"КодСценарий");
	ИменаКолонок.Вставить("КодЦФО",						"КодЦФО");
	ИменаКолонок.Вставить("КодСтатьяОборотов",			"КодСтатьяОборотов");
	ИменаКолонок.Вставить("КодВалюта",					"КодВалюта");
	ИменаКолонок.Вставить("КодКонтрагент",				"КодКонтрагент");
	ИменаКолонок.Вставить("КодДоговорКонтрагента",		"КодДоговорКонтрагента");
	ИменаКолонок.Вставить("КодПроект",					"КодПроект");
	ИменаКолонок.Вставить("КодНоменклатурнаяГруппа",	"КодНоменклатурнаяГруппа");
	ИменаКолонок.Вставить("КодБанковскийСчет",			"КодБанковскийСчет");
	ИменаКолонок.Вставить("КодСценарийКонтролируемый",	"КодСценарийКонтролируемый");
	ИменаКолонок.Вставить("КодОрганизация",				"КодОрганизация");
	
	// Дополнительные измерения (Аналитики).
	ИменаКолонок.Вставить("Аналитика_1",				"Аналитика_1");
	ИменаКолонок.Вставить("Аналитика_2",				"Аналитика_2");
	ИменаКолонок.Вставить("Аналитика_3",				"Аналитика_3");
	ИменаКолонок.Вставить("Аналитика_4",				"Аналитика_4");
	ИменаКолонок.Вставить("Аналитика_5",				"Аналитика_5");
	ИменаКолонок.Вставить("Аналитика_6",				"Аналитика_6");
	ИменаКолонок.Вставить("Аналитика_7",				"Аналитика_7");
	ИменаКолонок.Вставить("Аналитика_8",				"Аналитика_8");
	ИменаКолонок.Вставить("Аналитика_9",				"Аналитика_9");
	ИменаКолонок.Вставить("Аналитика_10",				"Аналитика_10");
	ИменаКолонок.Вставить("Аналитика_11",				"Аналитика_11");
	ИменаКолонок.Вставить("Аналитика_12",				"Аналитика_12");
	ИменаКолонок.Вставить("Аналитика_1_Key",			"Аналитика_1_Key");
	ИменаКолонок.Вставить("Аналитика_2_Key",			"Аналитика_2_Key");
	ИменаКолонок.Вставить("Аналитика_3_Key",			"Аналитика_3_Key");
	ИменаКолонок.Вставить("Аналитика_4_Key",			"Аналитика_4_Key");
	ИменаКолонок.Вставить("Аналитика_5_Key",			"Аналитика_5_Key");
	ИменаКолонок.Вставить("Аналитика_6_Key",			"Аналитика_6_Key");
	ИменаКолонок.Вставить("Аналитика_7_Key",			"Аналитика_7_Key");
	ИменаКолонок.Вставить("Аналитика_8_Key",			"Аналитика_8_Key");
	ИменаКолонок.Вставить("Аналитика_9_Key",			"Аналитика_9_Key");
	ИменаКолонок.Вставить("Аналитика_10_Key",			"Аналитика_10_Key");
	ИменаКолонок.Вставить("Аналитика_11_Key",			"Аналитика_11_Key");
	ИменаКолонок.Вставить("Аналитика_12_Key",			"Аналитика_12_Key");
	
	Возврат ИменаКолонок;
	// АПК:1297-вкл
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Получить список заданий
// 
// Возвращаемое значение:
//  СписокЗначений - Список функций получения данных и мен файлов выгрузки.
//
Функция ЗаданияДляВыгрузки() Экспорт
	
	СписокЗаданий = Новый СписокЗначений();
	
	СтруктураНастроек = бит_PowerBIСлужебный.ПолучитьНастройикPowerBI();

	// Версия 1.0.
	Если СтруктураНастроек.Выгрузка1 Тогда
		СписокЗаданий.Добавить("бит_PowerBIПереопределяемый.Валюты()",					"currencies.json");
		СписокЗаданий.Добавить("бит_PowerBIПереопределяемый.ВидыЦФО()",					"kind-cfr.json");
		СписокЗаданий.Добавить("бит_PowerBIПереопределяемый.СинонимыАналитик()",		"analytics_synonyms.json");
		СписокЗаданий.Добавить("бит_PowerBIПереопределяемый.ОборотыПоБюджетам()",		"budget.json");
		СписокЗаданий.Добавить("бит_PowerBIПереопределяемый.СтатьиОборотов()",			"articles.json");
		СписокЗаданий.Добавить("бит_PowerBIПереопределяемый.СценарииБюджетирования()",	"scenarios.json");
		СписокЗаданий.Добавить("бит_PowerBIПереопределяемый.ЦФО()",						"cfr.json");
		СписокЗаданий.Добавить("бит_PowerBIПереопределяемый.ОстаткиДС()",				"accounting-transactions.json");
		СписокЗаданий.Добавить("бит_PowerBIПереопределяемый.ВалютыУчета()",				"accounting-currencies.json");
	КонецЕсли;
	
	Возврат СписокЗаданий;
	
КонецФункции

#КонецОбласти
